<a href="https://colab.research.google.com/github/DinWaikabu/Pandas/blob/master/Eksplorasi_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [3]:
data = pd.read_csv('sample_data/california_housing_test.csv')
data.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0
5    -119.56     36.51  ...         1.6635             67000.0
6    -121.43     38.63  ...         1.6641             67000.0
7    -120.65     35.48  ...         3.2250            166900.0
8    -122.84     38.40  ...         3.6696            194400.0
9    -118.02     34.08  ...         2.3333            164200.0

[10 rows x 9 columns]

In [13]:
data.columns # menagmbil nama kolom

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [14]:
data.values

array([[-1.22050e+02,  3.73700e+01,  2.70000e+01, ...,  6.06000e+02,
         6.60850e+00,  3.44700e+05],
       [-1.18300e+02,  3.42600e+01,  4.30000e+01, ...,  2.77000e+02,
         3.59900e+00,  1.76500e+05],
       [-1.17810e+02,  3.37800e+01,  2.70000e+01, ...,  4.95000e+02,
         5.79340e+00,  2.70500e+05],
       ...,
       [-1.19700e+02,  3.63000e+01,  1.00000e+01, ...,  2.20000e+02,
         2.28950e+00,  6.20000e+04],
       [-1.17120e+02,  3.41000e+01,  4.00000e+01, ...,  1.40000e+01,
         3.27080e+00,  1.62500e+05],
       [-1.19630e+02,  3.44200e+01,  4.20000e+01, ...,  2.60000e+02,
         8.56080e+00,  5.00001e+05]])

## Memilih kolom dan baris menggunakan index

untuk memilih kolom dan baris kita dapat menggunakan :

1.   .loc
2.   .iloc

In [4]:
data.loc[0:4,:'population'] #memilih baris dengan index 0-4 dan semua kolom dari kolom populasi ke kiri

   longitude  latitude  ...  total_bedrooms  population
0    -122.05     37.37  ...           661.0      1537.0
1    -118.30     34.26  ...           310.0       809.0
2    -117.81     33.78  ...           507.0      1484.0
3    -118.36     33.82  ...            15.0        49.0
4    -119.67     36.33  ...           244.0       850.0

[5 rows x 6 columns]

In [5]:
data.loc[:4,['longitude','population']] # memilih baris dengan index 0-4 dan kolom langitude dan population

   longitude  population
0    -122.05      1537.0
1    -118.30       809.0
2    -117.81      1484.0
3    -118.36        49.0
4    -119.67       850.0

In [7]:
data.iloc[0:4, :] # memilih baris dengan index 0-3 dan kolom semua kolom yang ada dalam data frame

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0

[4 rows x 9 columns]

In [8]:
data.iloc[[1,10], :3] # memilih baris dengan index 1 dan 10, dan kolom index 0 - index 2 atau kolom logitude-housing_median_age

    longitude  latitude  housing_median_age
1     -118.30     34.26                43.0
10    -118.24     33.98                45.0

In [9]:
data.iloc[:4, [3]] # memilih baris dengan index 0-3 dan kolom index ke 3 atau kolom ke 4.

   total_rooms
0       3885.0
1       1510.0
2       3589.0
3         67.0

### Memilih Kolom di Data Frame
selain dengan indexing, kita juga bisa memilih atau seleksi kolom dengan cara mengakses langsu nama variabel dari kolom tersebut

In [19]:
data['population'].head(4)

0    1537.0
1     809.0
2    1484.0
3      49.0
Name: population, dtype: float64

In [21]:
data[['population']].head()

   population
0      1537.0
1       809.0
2      1484.0
3        49.0
4       850.0

In [24]:
data[['longitude', 'population', 'total_rooms']].head()

   longitude  population  total_rooms
0    -122.05      1537.0       3885.0
1    -118.30       809.0       1510.0
2    -117.81      1484.0       3589.0
3    -118.36        49.0         67.0
4    -119.67       850.0       1241.0

### Menambah kolom

In [28]:
data['income_value']= data['median_income']/data['median_house_value']
data.head(4)

   longitude  latitude  ...  median_house_value  income_value
0    -122.05     37.37  ...            344700.0      0.000019
1    -118.30     34.26  ...            176500.0      0.000020
2    -117.81     33.78  ...            270500.0      0.000021
3    -118.36     33.82  ...            330000.0      0.000019

[4 rows x 10 columns]